results/ASPLOS/WILDFIRE/YCSB-ROCKSDB-CORUN-200sec/50M-KEYS/8/batchsize-256/ycsbwkldb/CIPI_PERF.out
Setting g_min_fd 4 
Setting g_min_fd 4 
RocksDB:    version 5.4
Date:       Sun Mar  3 20:43:41 2024
CPU:        128 * AMD EPYC 7543 32-Core Processor
CPUCache:   512 KB
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Keys:       20 bytes each
Values:     4096 bytes each (2048 bytes after compression)
Entries:    50000000
Prefix:    20 bytes
Keys per prefix:    0
RawSize:    196266.2 MB (estimated)
FileSize:   98609.9 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Memtablerep: prefix_hash
Perf Level: 1
------------------------------------------------
DB path: [/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/DATA]
ycsbwkldb    :       4.861 micros/op 205715 ops/sec; ( reads:4956826 writes:261173 total:50000000 found:4956826)
	Command being timed: "/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/db_bench --db=/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/DATA --num_levels=6 --key_size=20 --prefix_size=20 --memtablerep=prefix_hash --bloom_bits=10 --bloom_locality=1 --use_existing_db=1 --num=50000000 --duration=200 --compression_type=none --value_size=4096 --threads=8 --benchmarks=ycsbwkldb --use_existing_db=1 --mmap_read=0 --threads=8"
	User time (seconds): 451.86
	System time (seconds): 337.74
	Percent of CPU this job got: 376%
	Elapsed (wall clock) time (h:mm:ss or m:ss): 3:29.55
	Average shared text size (kbytes): 0
	Average unshared data size (kbytes): 0
	Average stack size (kbytes): 0
	Average total size (kbytes): 0
	Maximum resident set size (kbytes): 1964836
	Average resident set size (kbytes): 0
	Major (requiring I/O) page faults: 64
	Minor (reclaiming a frame) page faults: 4884035
	Voluntary context switches: 25655758
	Involuntary context switches: 5004
	Swaps: 0
	File system inputs: 144508408
	File system outputs: 184272696
	Socket messages sent: 0
	Socket messages received: 0
	Signals delivered: 0
	Page size (bytes): 4096
	Exit status: 0
[80751.338539] sh (240185): drop_caches: 3
[80751.409228] sh (240192): drop_caches: 3
[80785.639611] write_proc_unbounded: Value of write = 1
[80785.639620] write_proc_2mb_limit: Value of write = 1
[80785.639624] write_proc_bitmap_shift: Value of write = 38
[80785.645111] write_proc_unbounded: Value of write = 1
[80785.645119] write_proc_2mb_limit: Value of write = 1
[80785.645123] write_proc_bitmap_shift: Value of write = 38
[80995.086513] write_proc_unbounded: Value of write = 0
[80995.086522] write_proc_2mb_limit: Value of write = 0
[80995.193672] write_proc_unbounded: Value of write = 0
[80995.193681] write_proc_2mb_limit: Value of write = 0